OpenAtomFoundation/TobudOS/board/STM8L052R8T6/LIB/inc/stm8l15x_tim1.h
} TIM1_DMABurstLength_TypeDef;

/**
  * @}
  */
  
/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/* Exported macros -----------------------------------------------------------*/
/** @defgroup TIM1_Exported_Macros
  * @{
  */
#define IS_TIM1_OC_MODE(MODE) (((MODE) ==  TIM1_OCMode_Timing) || \
                               ((MODE) == TIM1_OCMode_Active) || \
                               ((MODE) == TIM1_OCMode_Inactive) || \
                               ((MODE) == TIM1_OCMode_Toggle)|| \
                               ((MODE) == TIM1_OCMode_PWM1) || \
                               ((MODE) == TIM1_OCMode_PWM2))

#define IS_TIM1_OCM(MODE)(((MODE) ==  TIM1_OCMode_Timing) || \
                          ((MODE) == TIM1_OCMode_Active) || \
                          ((MODE) == TIM1_OCMode_Inactive) || \
                          ((MODE) == TIM1_OCMode_Toggle)|| \
                          ((MODE) == TIM1_OCMode_PWM1) || \
                          ((MODE) == TIM1_OCMode_PWM2) || \
                          ((MODE) == (uint8_t)TIM1_ForcedAction_Active) || \
                          ((MODE) == (uint8_t)TIM1_ForcedAction_Inactive))

#define IS_TIM1_OPM_MODE(MODE) (((MODE) == TIM1_OPMode_Single) || \
                                ((MODE) == TIM1_OPMode_Repetitive))

#define IS_TIM1_CHANNEL(CHANNEL) (((CHANNEL) == TIM1_Channel_1) || \
                                  ((CHANNEL) == TIM1_Channel_2) || \
                                  ((CHANNEL) == TIM1_Channel_3) || \
                                  ((CHANNEL) == TIM1_Channel_4))

#define IS_TIM1_PWMI_CHANNEL(CHANNEL) (((CHANNEL) == TIM1_Channel_1) || \
                                       ((CHANNEL) == TIM1_Channel_2))

#define IS_TIM1_COMPLEMENTARY_CHANNEL(CHANNEL) (((CHANNEL) == TIM1_Channel_1) || \
    ((CHANNEL) == TIM1_Channel_2) || \
    ((CHANNEL) == TIM1_Channel_3))

#define IS_TIM1_COUNTER_MODE(MODE) (((MODE) == TIM1_CounterMode_Up) || \
                                    ((MODE) == TIM1_CounterMode_Down) || \
                                    ((MODE) == TIM1_CounterMode_CenterAligned1) || \
                                    ((MODE) == TIM1_CounterMode_CenterAligned2) || \
                                    ((MODE) == TIM1_CounterMode_CenterAligned3))

#define IS_TIM1_OC_POLARITY(POLARITY) (((POLARITY) == TIM1_OCPolarity_High) || \
                                       ((POLARITY) == TIM1_OCPolarity_Low))

#define IS_TIM1_OCN_POLARITY(POLARITY) (((POLARITY) == TIM1_OCNPolarity_High) || \
                                        ((POLARITY) == TIM1_OCNPolarity_Low))

#define IS_TIM1_OUTPUT_STATE(STATE) (((STATE) == TIM1_OutputState_Disable) || \
                                     ((STATE) == TIM1_OutputState_Enable))

#define IS_TIM1_OUTPUTN_STATE(STATE) (((STATE) == TIM1_OutputNState_Disable) ||\
                                      ((STATE) == TIM1_OutputNState_Enable))

#define IS_TIM1_BREAK_STATE(STATE) (((STATE) == TIM1_BreakState_Enable) || \
                                    ((STATE) == TIM1_BreakState_Disable))

#define IS_TIM1_BREAK_POLARITY(POLARITY) (((POLARITY) == TIM1_BreakPolarity_Low) || \
    ((POLARITY) == TIM1_BreakPolarity_High))

#define IS_TIM1_AUTOMATIC_OUTPUT_STATE(STATE) (((STATE) == TIM1_AutomaticOutput_Enable) || \
    ((STATE) == TIM1_AutomaticOutput_Disable))

#define IS_TIM1_LOCK_LEVEL(LEVEL) (((LEVEL) == TIM1_LockLevel_Off) || \
                                   ((LEVEL) == TIM1_LockLevel_1) || \
                                   ((LEVEL) == TIM1_LockLevel_2) || \
                                   ((LEVEL) == TIM1_LockLevel_3))

#define IS_TIM1_OSSI_STATE(STATE) (((STATE) == TIM1_OSSIState_Enable) || \
                                   ((STATE) == TIM1_OSSIState_Disable))

#define IS_TIM1_OCIDLE_STATE(STATE) (((STATE) == TIM1_OCIdleState_Set) || \
                                     ((STATE) == TIM1_OCIdleState_Reset))

#define IS_TIM1_OCNIDLE_STATE(STATE) (((STATE) == TIM1_OCNIdleState_Set) || \
                                      ((STATE) == TIM1_OCNIdleState_Reset))

#define IS_TIM1_IC_POLARITY(POLARITY) (((POLARITY) == TIM1_ICPolarity_Rising) || \
                                       ((POLARITY) == TIM1_ICPolarity_Falling))

#define IS_TIM1_IC_SELECTION(SELECTION) (((SELECTION) == TIM1_ICSelection_DirectTI) || \
    ((SELECTION) == TIM1_ICSelection_IndirectTI) || \
    ((SELECTION) == TIM1_ICSelection_TRGI))

#define IS_TIM1_IC_PRESCALER(PRESCALER) (((PRESCALER) == TIM1_ICPSC_DIV1) || \
    ((PRESCALER) == TIM1_ICPSC_DIV2) || \
    ((PRESCALER) == TIM1_ICPSC_DIV4) || \
    ((PRESCALER) == TIM1_ICPSC_DIV8))

#define IS_TIM1_OCREFERENCECECLEAR_SOURCE(SOURCE) (((SOURCE) == TIM1_OCReferenceClear_ETRF) || \
    ((SOURCE) == TIM1_OCReferenceClear_OCREFCLR))

#define IS_TIM1_IT(IT) ((IT) != 0x00)

#define IS_TIM1_GET_IT(IT) (((IT) == TIM1_IT_Update) || \
                            ((IT) == TIM1_IT_CC1) || \
                            ((IT) == TIM1_IT_CC2) || \
                            ((IT) == TIM1_IT_CC3) || \
                            ((IT) == TIM1_IT_CC4) || \
                            ((IT) == TIM1_IT_COM) || \
                            ((IT) == TIM1_IT_Trigger) || \
                            ((IT) == TIM1_IT_Break))

#define IS_TIM1_EXT_PRESCALER(PRESCALER) (((PRESCALER) == TIM1_ExtTRGPSC_OFF) || \
    ((PRESCALER) == TIM1_ExtTRGPSC_DIV2) || \
    ((PRESCALER) == TIM1_ExtTRGPSC_DIV4) || \
    ((PRESCALER) == TIM1_ExtTRGPSC_DIV8))

#define IS_TIM1_TRIGGER_SELECTION(SELECTION) \
  (((SELECTION) == TIM1_TRGSelection_TIM2) || \
   ((SELECTION) == TIM1_TRGSelection_TIM3) || \
   ((SELECTION) == TIM1_TRGSelection_TIM4) || \
   ((SELECTION) == TIM1_TRGSelection_TIM5) || \
   ((SELECTION) == TIM1_TRGSelection_TI1F_ED) || \
   ((SELECTION) == TIM1_TRGSelection_TI1FP1) || \
   ((SELECTION) == TIM1_TRGSelection_TI2FP2) || \
   ((SELECTION) == TIM1_TRGSelection_ETRF))


#define IS_TIM1_TIX_TRIGGER_SELECTION(SELECTION) \
  (((SELECTION) == TIM1_TRGSelection_TI1F_ED) || \
   ((SELECTION) == TIM1_TRGSelection_TI1FP1) || \
   ((SELECTION) == TIM1_TRGSelection_TI2FP2))

